results/local_nvme/fio-rw:rw-rwmixread:33-numjobs:1-iodepth:1-bs:1M.out
fio-rw:rw-rwmixread:33-numjobs:1-iodepth:1-bs:1M: (g=0): rw=rw, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
fio-3.28
Starting 1 process
fio-rw:rw-rwmixread:33-numjobs:1-iodepth:1-bs:1M: Laying out IO file (1 file / 4096MiB)

fio-rw:rw-rwmixread:33-numjobs:1-iodepth:1-bs:1M: (groupid=0, jobs=1): err= 0: pid=163909: Sun Feb 25 14:36:13 2024
  read: IOPS=440, BW=441MiB/s (462MB/s)(130GiB/300944msec)
    slat (usec): min=103, max=2451, avg=290.87, stdev=155.58
    clat (nsec): min=404, max=43598, avg=862.27, stdev=816.04
     lat (usec): min=104, max=2453, avg=292.04, stdev=156.08
    clat percentiles (nsec):
     |  1.00th=[  494],  5.00th=[  532], 10.00th=[  556], 20.00th=[  596],
     | 30.00th=[  644], 40.00th=[  692], 50.00th=[  740], 60.00th=[  804],
     | 70.00th=[  884], 80.00th=[ 1020], 90.00th=[ 1256], 95.00th=[ 1400],
     | 99.00th=[ 3056], 99.50th=[ 3312], 99.90th=[ 4384], 99.95th=[24192],
     | 99.99th=[31360]
   bw (  KiB/s): min= 2052, max=1017856, per=100.00%, avg=648748.43, stdev=279203.45, samples=418
   iops        : min=    2, max=  994, avg=633.37, stdev=272.63, samples=418
  write: IOPS=892, BW=893MiB/s (936MB/s)(262GiB/300944msec); 0 zone resets
    slat (usec): min=154, max=1623, avg=292.69, stdev=54.85
    clat (nsec): min=447, max=1212.8k, avg=680.67, stdev=2375.26
     lat (usec): min=154, max=1626, avg=293.59, stdev=54.94
    clat percentiles (nsec):
     |  1.00th=[  498],  5.00th=[  524], 10.00th=[  540], 20.00th=[  564],
     | 30.00th=[  588], 40.00th=[  604], 50.00th=[  628], 60.00th=[  652],
     | 70.00th=[  684], 80.00th=[  740], 90.00th=[  844], 95.00th=[  948],
     | 99.00th=[ 1192], 99.50th=[ 1304], 99.90th=[ 2896], 99.95th=[14272],
     | 99.99th=[16512]
   bw (  MiB/s): min=    8, max= 1865, per=100.00%, avg=1282.41, stdev=544.33, samples=418
   iops        : min=    8, max= 1865, avg=1282.24, stdev=544.32, samples=418
  lat (nsec)   : 500=1.28%, 750=70.11%, 1000=19.29%
  lat (usec)   : 2=8.78%, 4=0.44%, 10=0.02%, 20=0.06%, 50=0.02%
  lat (msec)   : 2=0.01%
  cpu          : usr=16.82%, sys=70.32%, ctx=133343, majf=0, minf=17
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=132702,268624,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=441MiB/s (462MB/s), 441MiB/s-441MiB/s (462MB/s-462MB/s), io=130GiB (139GB), run=300944-300944msec
  WRITE: bw=893MiB/s (936MB/s), 893MiB/s-893MiB/s (936MB/s-936MB/s), io=262GiB (282GB), run=300944-300944msec

Disk stats (read/write):
  nvme0n1: ios=203200/861896, merge=0/18, ticks=98527/21058958, in_queue=21157485, util=64.37%