results/local_nvme/fio-rw:rw-rwmixread:33-numjobs:3-iodepth:1-bs:1M.out
fio-rw:rw-rwmixread:33-numjobs:3-iodepth:1-bs:1M: (g=0): rw=rw, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
...
fio-3.28
Starting 3 processes
fio-rw:rw-rwmixread:33-numjobs:3-iodepth:1-bs:1M: Laying out IO file (1 file / 4096MiB)
fio-rw:rw-rwmixread:33-numjobs:3-iodepth:1-bs:1M: Laying out IO file (1 file / 4096MiB)
fio-rw:rw-rwmixread:33-numjobs:3-iodepth:1-bs:1M: Laying out IO file (1 file / 4096MiB)

fio-rw:rw-rwmixread:33-numjobs:3-iodepth:1-bs:1M: (groupid=0, jobs=3): err= 0: pid=164680: Sun Feb 25 15:07:04 2024
  read: IOPS=1009, BW=1009MiB/s (1059MB/s)(297GiB/301559msec)
    slat (usec): min=106, max=5952, avg=410.50, stdev=401.63
    clat (nsec): min=413, max=108993, avg=881.98, stdev=522.77
     lat (usec): min=107, max=5955, avg=411.70, stdev=402.03
    clat percentiles (nsec):
     |  1.00th=[  502],  5.00th=[  540], 10.00th=[  564], 20.00th=[  604],
     | 30.00th=[  652], 40.00th=[  700], 50.00th=[  764], 60.00th=[  844],
     | 70.00th=[  948], 80.00th=[ 1096], 90.00th=[ 1320], 95.00th=[ 1480],
     | 99.00th=[ 2608], 99.50th=[ 3024], 99.90th=[ 5728], 99.95th=[ 7392],
     | 99.99th=[16768]
   bw (  MiB/s): min=   10, max= 2801, per=100.00%, avg=1697.35, stdev=230.66, samples=1077
   iops        : min=   10, max= 2801, avg=1696.74, stdev=230.64, samples=1077
  write: IOPS=2051, BW=2051MiB/s (2151MB/s)(604GiB/301559msec); 0 zone resets
    slat (usec): min=157, max=4429, avg=313.93, stdev=84.34
    clat (nsec): min=435, max=40137, avg=716.89, stdev=382.16
     lat (usec): min=157, max=4432, avg=314.87, stdev=84.38
    clat percentiles (nsec):
     |  1.00th=[  524],  5.00th=[  548], 10.00th=[  564], 20.00th=[  596],
     | 30.00th=[  620], 40.00th=[  644], 50.00th=[  668], 60.00th=[  700],
     | 70.00th=[  740], 80.00th=[  796], 90.00th=[  908], 95.00th=[ 1012],
     | 99.00th=[ 1256], 99.50th=[ 1368], 99.90th=[ 2384], 99.95th=[10176],
     | 99.99th=[17536]
   bw (  MiB/s): min=   12, max= 5395, per=100.00%, avg=3445.39, stdev=467.80, samples=1078
   iops        : min=   12, max= 5395, avg=3444.75, stdev=467.80, samples=1078
  lat (nsec)   : 500=0.36%, 750=63.96%, 1000=23.47%
  lat (usec)   : 2=11.63%, 4=0.48%, 10=0.05%, 20=0.04%, 50=0.01%
  lat (usec)   : 250=0.01%
  cpu          : usr=14.03%, sys=57.74%, ctx=912945, majf=0, minf=56
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=304421,618499,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=1009MiB/s (1059MB/s), 1009MiB/s-1009MiB/s (1059MB/s-1059MB/s), io=297GiB (319GB), run=301559-301559msec
  WRITE: bw=2051MiB/s (2151MB/s), 2051MiB/s-2051MiB/s (2151MB/s-2151MB/s), io=604GiB (649GB), run=301559-301559msec

Disk stats (read/write):
  nvme0n1: ios=437695/1804577, merge=0/19, ticks=425897/49761661, in_queue=50187558, util=92.52%